testCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  8
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// (please note these are the sequences) 
//  minusL --- minusL1 --- minusLquad --- 0 --- Lquad --- L1 --- L 
/*
       0
       |
    minusH
       |
    minusH1
*/

L            0.02;
L1           0.002;
Lconn        0.0019;


minusH       -0.0015; // needs to be slightly higher than R2
minusH1      -0.0405;

minusL       #calc "-1.0*$L";
minusL1      #calc "-1.0*$L1";
minusLconn   #calc "-1.0*$Lconn";


b1           0.0008; // for the parallelepiped
R1           0.0009;
f1           1; // this change the curvature of buffer mesh
R2           0.00105;

minusb1  #calc "-1.0*$b1";
minusR1  #calc "-1.0*$R1";
minusR2  #calc "-1.0*$R2";

//- Divides inner parallelepiped
nYArmsInner 11;

//- Divides outer circle
nYArmsOuter 3;

//- Divides boundary layer
nLayer      2;

//- Calculated cells number to assure AR = 1
nZArmsInner $nYArmsInner;
nXArmsInner #calc "std::round(($L-$L1)/2.0/$b1*$nYArmsInner)";
nZArmsOuter $nYArmsOuter;
nZMixInner #calc "std::round(($minusH-1.0*$minusH1)/2.0/$b1*$nYArmsInner)";
nAux1      #calc "std::round(($L1-$b1)/2.0/$b1*$nYArmsInner)";
nAux2      $nAux1; //#calc "std::round(-1.0*($minusH-$b1)/2.0/$b1*$nYArmsInner)";

vertices
(
    // inletA - parallelepiped mesh
    ($minusL #calc "$minusb1*sqrt(2.0)/2.0" #calc "$b1*sqrt(2.0)/2.0")             // 0
    ($minusL1 #calc "$minusb1*sqrt(2.0)/2.0" #calc "$b1*sqrt(2.0)/2.0")
    ($minusL1 #calc "$minusb1*sqrt(2.0)/2.0" #calc "$minusb1*sqrt(2.0)/2.0")
    ($minusL #calc "$minusb1*sqrt(2.0)/2.0" #calc "$minusb1*sqrt(2.0)/2.0")
    ($minusL #calc "$b1*sqrt(2.0)/2.0" #calc "$b1*sqrt(2.0)/2.0")
    ($minusL1 #calc "$b1*sqrt(2.0)/2.0" #calc "$b1*sqrt(2.0)/2.0")
    ($minusL1 #calc "$b1*sqrt(2.0)/2.0" #calc "$minusb1*sqrt(2.0)/2.0")
    ($minusL #calc "$b1*sqrt(2.0)/2.0" #calc "$minusb1*sqrt(2.0)/2.0")             // 7
    
    // inletA - buffer mesh
    ($minusL #calc "$minusR1*sqrt(2.0)/2.0" #calc "$R1*sqrt(2.0)/2.0")             // 8
    ($minusL1 #calc "$minusR1*sqrt(2.0)/2.0" #calc "$R1*sqrt(2.0)/2.0")
    ($minusL1 #calc "$minusR1*sqrt(2.0)/2.0" #calc "$minusR1*sqrt(2.0)/2.0")
    ($minusL #calc "$minusR1*sqrt(2.0)/2.0" #calc "$minusR1*sqrt(2.0)/2.0")
    ($minusL #calc "$R1*sqrt(2.0)/2.0" #calc "$R1*sqrt(2.0)/2.0")
    ($minusL1 #calc "$R1*sqrt(2.0)/2.0" #calc "$R1*sqrt(2.0)/2.0")
    ($minusL1 #calc "$R1*sqrt(2.0)/2.0" #calc "$minusR1*sqrt(2.0)/2.0")
    ($minusL #calc "$R1*sqrt(2.0)/2.0" #calc "$minusR1*sqrt(2.0)/2.0")             // 15
    
    // inletA - outer mesh
    ($minusL #calc "$minusR2*sqrt(2.0)/2.0" #calc "$R2*sqrt(2.0)/2.0")             // 16
    ($minusL1 #calc "$minusR2*sqrt(2.0)/2.0" #calc "$R2*sqrt(2.0)/2.0")
    ($minusL1 #calc "$minusR2*sqrt(2.0)/2.0" #calc "$minusR2*sqrt(2.0)/2.0")
    ($minusL #calc "$minusR2*sqrt(2.0)/2.0" #calc "$minusR2*sqrt(2.0)/2.0")
    ($minusL #calc "$R2*sqrt(2.0)/2.0" #calc "$R2*sqrt(2.0)/2.0")
    ($minusL1 #calc "$R2*sqrt(2.0)/2.0" #calc "$R2*sqrt(2.0)/2.0")
    ($minusL1 #calc "$R2*sqrt(2.0)/2.0" #calc "$minusR2*sqrt(2.0)/2.0")
    ($minusL #calc "$R2*sqrt(2.0)/2.0" #calc "$minusR2*sqrt(2.0)/2.0")              // 23
    
    // inletB - parallelepiped mesh
    ($L1 #calc "$minusb1*sqrt(2.0)/2.0" #calc "$b1*sqrt(2.0)/2.0")             // 24
    ($L #calc "$minusb1*sqrt(2.0)/2.0" #calc "$b1*sqrt(2.0)/2.0")
    ($L #calc "$minusb1*sqrt(2.0)/2.0" #calc "$minusb1*sqrt(2.0)/2.0")
    ($L1 #calc "$minusb1*sqrt(2.0)/2.0" #calc "$minusb1*sqrt(2.0)/2.0")
    ($L1 #calc "$b1*sqrt(2.0)/2.0" #calc "$b1*sqrt(2.0)/2.0")
    ($L #calc "$b1*sqrt(2.0)/2.0" #calc "$b1*sqrt(2.0)/2.0")
    ($L #calc "$b1*sqrt(2.0)/2.0" #calc "$minusb1*sqrt(2.0)/2.0")
    ($L1 #calc "$b1*sqrt(2.0)/2.0" #calc "$minusb1*sqrt(2.0)/2.0")             // 31
    
    // inletB - buffer mesh
    ($L1 #calc "$minusR1*sqrt(2.0)/2.0" #calc "$R1*sqrt(2.0)/2.0")             // 32
    ($L #calc "$minusR1*sqrt(2.0)/2.0" #calc "$R1*sqrt(2.0)/2.0")
    ($L #calc "$minusR1*sqrt(2.0)/2.0" #calc "$minusR1*sqrt(2.0)/2.0")
    ($L1 #calc "$minusR1*sqrt(2.0)/2.0" #calc "$minusR1*sqrt(2.0)/2.0")
    ($L1 #calc "$R1*sqrt(2.0)/2.0" #calc "$R1*sqrt(2.0)/2.0")
    ($L #calc "$R1*sqrt(2.0)/2.0" #calc "$R1*sqrt(2.0)/2.0")
    ($L #calc "$R1*sqrt(2.0)/2.0" #calc "$minusR1*sqrt(2.0)/2.0")
    ($L1 #calc "$R1*sqrt(2.0)/2.0" #calc "$minusR1*sqrt(2.0)/2.0")             // 39
    
    // inletB - outlet mesh
    ($L1 #calc "$minusR2*sqrt(2.0)/2.0" #calc "$R2*sqrt(2.0)/2.0")             // 40
    ($L #calc "$minusR2*sqrt(2.0)/2.0" #calc "$R2*sqrt(2.0)/2.0")
    ($L #calc "$minusR2*sqrt(2.0)/2.0" #calc "$minusR2*sqrt(2.0)/2.0")
    ($L1 #calc "$minusR2*sqrt(2.0)/2.0" #calc "$minusR2*sqrt(2.0)/2.0")
    ($L1 #calc "$R2*sqrt(2.0)/2.0" #calc "$R2*sqrt(2.0)/2.0")
    ($L #calc "$R2*sqrt(2.0)/2.0" #calc "$R2*sqrt(2.0)/2.0")
    ($L #calc "$R2*sqrt(2.0)/2.0" #calc "$minusR2*sqrt(2.0)/2.0")
    ($L1 #calc "$R2*sqrt(2.0)/2.0" #calc "$minusR2*sqrt(2.0)/2.0")              // 47
    
    // outlet - parallelepiped mesh
    (#calc "$minusb1*sqrt(2.0)/2.0" $minusH #calc "$b1*sqrt(2.0)/2.0")          // 48
    (#calc "$b1*sqrt(2.0)/2.0" $minusH #calc "$b1*sqrt(2.0)/2.0")
    (#calc "$b1*sqrt(2.0)/2.0" $minusH #calc "$minusb1*sqrt(2.0)/2.0")
    (#calc "$minusb1*sqrt(2.0)/2.0" $minusH #calc "$minusb1*sqrt(2.0)/2.0")
    (#calc "$minusb1*sqrt(2.0)/2.0" $minusH1 #calc "$b1*sqrt(2.0)/2.0")                                
    (#calc "$b1*sqrt(2.0)/2.0" $minusH1 #calc "$b1*sqrt(2.0)/2.0")
    (#calc "$b1*sqrt(2.0)/2.0" $minusH1 #calc "$minusb1*sqrt(2.0)/2.0")
    (#calc "$minusb1*sqrt(2.0)/2.0" $minusH1 #calc "$minusb1*sqrt(2.0)/2.0")    // 55
    
    // outlet - buffer mesh
    (#calc "$minusR1*sqrt(2.0)/2.0" $minusH #calc "$R1*sqrt(2.0)/2.0")          // 56
    (#calc "$R1*sqrt(2.0)/2.0" $minusH #calc "$R1*sqrt(2.0)/2.0")
    (#calc "$R1*sqrt(2.0)/2.0" $minusH #calc "$minusR1*sqrt(2.0)/2.0")
    (#calc "$minusR1*sqrt(2.0)/2.0" $minusH #calc "$minusR1*sqrt(2.0)/2.0")
    (#calc "$minusR1*sqrt(2.0)/2.0" $minusH1 #calc "$R1*sqrt(2.0)/2.0")                                
    (#calc "$R1*sqrt(2.0)/2.0" $minusH1 #calc "$R1*sqrt(2.0)/2.0")
    (#calc "$R1*sqrt(2.0)/2.0" $minusH1 #calc "$minusR1*sqrt(2.0)/2.0")
    (#calc "$minusR1*sqrt(2.0)/2.0" $minusH1 #calc "$minusR1*sqrt(2.0)/2.0")    // 63
    
    // outlet - outlet mesh
    (#calc "$minusR2*sqrt(2.0)/2.0" $minusH #calc "$R2*sqrt(2.0)/2.0")          // 64
    (#calc "$R2*sqrt(2.0)/2.0" $minusH #calc "$R2*sqrt(2.0)/2.0")
    (#calc "$R2*sqrt(2.0)/2.0" $minusH #calc "$minusR2*sqrt(2.0)/2.0")
    (#calc "$minusR2*sqrt(2.0)/2.0" $minusH #calc "$minusR2*sqrt(2.0)/2.0")
    (#calc "$minusR2*sqrt(2.0)/2.0" $minusH1 #calc "$R2*sqrt(2.0)/2.0")                                
    (#calc "$R2*sqrt(2.0)/2.0" $minusH1 #calc "$R2*sqrt(2.0)/2.0")
    (#calc "$R2*sqrt(2.0)/2.0" $minusH1 #calc "$minusR2*sqrt(2.0)/2.0")
    (#calc "$minusR2*sqrt(2.0)/2.0" $minusH1 #calc "$minusR2*sqrt(2.0)/2.0")    // 71
        
    // connection - inner mesh
    (#calc "$minusb1*sqrt(2.0)/2.0" #calc "$b1*sqrt(2.0)/2.0" #calc "$b1*sqrt(2.0)/2.0")          // 72
    (#calc "$b1*sqrt(2.0)/2.0" #calc "$b1*sqrt(2.0)/2.0" #calc "$b1*sqrt(2.0)/2.0")
    (#calc "$b1*sqrt(2.0)/2.0" #calc "$b1*sqrt(2.0)/2.0" #calc "$minusb1*sqrt(2.0)/2.0")
    (#calc "$minusb1*sqrt(2.0)/2.0" #calc "$b1*sqrt(2.0)/2.0" #calc "$minusb1*sqrt(2.0)/2.0")
    (#calc "$minusb1*sqrt(2.0)/2.0" #calc "$minusb1*sqrt(2.0)/2.0" #calc "$b1*sqrt(2.0)/2.0")                                
    (#calc "$b1*sqrt(2.0)/2.0" #calc "$minusb1*sqrt(2.0)/2.0" #calc "$b1*sqrt(2.0)/2.0")
    (#calc "$b1*sqrt(2.0)/2.0" #calc "$minusb1*sqrt(2.0)/2.0" #calc "$minusb1*sqrt(2.0)/2.0")
    (#calc "$minusb1*sqrt(2.0)/2.0" #calc "$minusb1*sqrt(2.0)/2.0" #calc "$minusb1*sqrt(2.0)/2.0")        // 79
    
    (#calc "$minusR1*sqrt(2.0)/2.0" #calc "$R1*sqrt(2.0)/2.0" #calc "$R1*sqrt(2.0)/2.0")          // 80
    (#calc "$R1*sqrt(2.0)/2.0" #calc "$R1*sqrt(2.0)/2.0" #calc "$R1*sqrt(2.0)/2.0")    
    (#calc "$R1*sqrt(2.0)/2.0" #calc "$R1*sqrt(2.0)/2.0" #calc "$minusR1*sqrt(2.0)/2.0")    
    (#calc "$minusR1*sqrt(2.0)/2.0" #calc "$R1*sqrt(2.0)/2.0" #calc "$minusR1*sqrt(2.0)/2.0")    
    (#calc "$minusR1*sqrt(2.0)/2.0" #calc "$minusR1*sqrt(2.0)/2.0" #calc "$R1*sqrt(2.0)/2.0")                           
    (#calc "$R1*sqrt(2.0)/2.0" #calc "$minusR1*sqrt(2.0)/2.0" #calc "$R1*sqrt(2.0)/2.0")    
    (#calc "$R1*sqrt(2.0)/2.0" #calc "$minusR1*sqrt(2.0)/2.0" #calc "$minusR1*sqrt(2.0)/2.0")    
    (#calc "$minusR1*sqrt(2.0)/2.0" #calc "$minusR1*sqrt(2.0)/2.0" #calc "$minusR1*sqrt(2.0)/2.0")        // 87
    
    
    // connection - outer mesh
    (#calc "$minusR2*sqrt(2.0)/2.0" #calc "$R2*sqrt(2.0)/2.0" #calc "$R2*sqrt(2.0)/2.0")          // 88
    (#calc "$R2*sqrt(2.0)/2.0" #calc "$R2*sqrt(2.0)/2.0" #calc "$R2*sqrt(2.0)/2.0")
    (#calc "$R2*sqrt(2.0)/2.0" #calc "$R2*sqrt(2.0)/2.0" #calc "$minusR2*sqrt(2.0)/2.0")
    (#calc "$minusR2*sqrt(2.0)/2.0" #calc "$R2*sqrt(2.0)/2.0" #calc "$minusR2*sqrt(2.0)/2.0")
    (#calc "$minusR2*sqrt(2.0)/2.0" #calc "$minusR2*sqrt(2.0)/2.0" #calc "$R2*sqrt(2.0)/2.0")                                
    (#calc "$R2*sqrt(2.0)/2.0" #calc "$minusR2*sqrt(2.0)/2.0" #calc "$R2*sqrt(2.0)/2.0")
    (#calc "$R2*sqrt(2.0)/2.0" #calc "$minusR2*sqrt(2.0)/2.0" #calc "$minusR2*sqrt(2.0)/2.0")
    (#calc "$minusR2*sqrt(2.0)/2.0" #calc "$minusR2*sqrt(2.0)/2.0" #calc "$minusR2*sqrt(2.0)/2.0")        // 95
    
     
);


blocks
(
    //-inletA inner
    hex (0 1 2 3 4 5 6 7) ($nXArmsInner $nYArmsInner $nZArmsInner) simpleGrading (1 1 1)    //0
    
    //-buffer mesh
    hex (3 2 10 11 7 6 14 15) ($nXArmsInner $nYArmsOuter $nZArmsInner) simpleGrading (1 1 1)
    hex (4 5 6 7 12 13 14 15) ($nXArmsInner $nYArmsInner $nZArmsOuter) simpleGrading (1 1 1)
    hex (8 9 1 0 12 13 5 4) ($nXArmsInner $nYArmsOuter $nZArmsInner) simpleGrading (1 1 1)
    hex (8 9 10 11 0 1 2 3) ($nXArmsInner $nYArmsInner $nZArmsOuter) simpleGrading (1 1 1)
    
    //-outer mesh
    hex (11 10 18 19 15 14 22 23) ($nXArmsInner $nLayer $nZArmsInner) simpleGrading (1 1 1)  //5
    hex (12 13 14 15 20 21 22 23) ($nXArmsInner $nYArmsInner $nLayer) simpleGrading (1 1 1)
    hex (16 17 9 8 20 21 13 12) ($nXArmsInner $nLayer $nZArmsInner) simpleGrading (1 1 1)
    hex (16 17 18 19 8 9 10 11) ($nXArmsInner $nYArmsInner $nLayer) simpleGrading (1 1 1)
    
    //-inletB inner
    hex (24 25 26 27 28 29 30 31) ($nXArmsInner $nYArmsInner $nZArmsInner) simpleGrading (1 1 1)
    
    //-buffer mesh
    hex (27 26 34 35 31 30 38 39) ($nXArmsInner $nYArmsOuter $nZArmsInner) simpleGrading (1 1 1)  //10
    hex (28 29 30 31 36 37 38 39) ($nXArmsInner $nYArmsInner $nZArmsOuter) simpleGrading (1 1 1)
    hex (32 33 25 24 36 37 29 28) ($nXArmsInner $nYArmsOuter $nZArmsInner) simpleGrading (1 1 1)
    hex (32 33 34 35 24 25 26 27) ($nXArmsInner $nYArmsInner $nZArmsOuter) simpleGrading (1 1 1)
    
    //-outer mesh
    hex (35 34 42 43 39 38 46 47) ($nXArmsInner $nLayer $nZArmsInner) simpleGrading (1 1 1)
    hex (36 37 38 39 44 45 46 47) ($nXArmsInner $nYArmsInner $nLayer) simpleGrading (1 1 1)  //15
    hex (40 41 33 32 44 45 37 36) ($nXArmsInner $nLayer $nZArmsInner) simpleGrading (1 1 1)
    hex (40 41 42 43 32 33 34 35) ($nXArmsInner $nYArmsInner $nLayer) simpleGrading (1 1 1)
    
    //-outlet inner
    hex (52 53 54 55 48 49 50 51) ($nYArmsInner $nYArmsInner $nZMixInner) simpleGrading (1 1 1)
    
    //-outlet buffer
    hex (55 54 62 63 51 50 58 59) ($nYArmsInner $nYArmsOuter $nZMixInner) simpleGrading (1 1 1)
    hex (53 61 62 54 49 57 58 50) ($nYArmsOuter $nYArmsInner $nZMixInner) simpleGrading (1 1 1)  //20
    hex (60 61 53 52 56 57 49 48) ($nYArmsInner $nYArmsOuter $nZMixInner) simpleGrading (1 1 1)
    hex (60 52 55 63 56 48 51 59) ($nYArmsOuter $nYArmsInner $nZMixInner) simpleGrading (1 1 1)
    
    //-outlet outer
    hex (63 62 70 71 59 58 66 67) ($nYArmsInner $nLayer $nZMixInner) simpleGrading (1 1 1)
    hex (61 69 70 62 57 65 66 58) ($nLayer $nYArmsInner $nZMixInner) simpleGrading (1 1 1)
    hex (68 69 61 60 64 65 57 56) ($nYArmsInner $nLayer $nZMixInner) simpleGrading (1 1 1)  //25
    hex (68 60 63 71 64 56 59 67) ($nLayer $nYArmsInner $nZMixInner) simpleGrading (1 1 1)
    
    //-connecting blocks
    hex (76 77 78 79 72 73 74 75) ($nYArmsInner $nYArmsInner $nZArmsInner) simpleGrading (1 1 1)
    hex (1 76 79 2 5 72 75 6) ($nAux1 $nYArmsInner $nZArmsInner) simpleGrading (1 1 1)
    hex (77 24 27 78 73 28 31 74) ($nAux1 $nYArmsInner $nZArmsInner) simpleGrading (1 1 1)
    hex (48 49 50 51 76 77 78 79) ($nYArmsInner $nYArmsInner $nAux2) simpleGrading (1 1 1)  //30
    
    hex (51 50 58 59 79 78 86 87) ($nYArmsInner $nYArmsOuter $nAux2) simpleGrading (1 1 1)
    hex (49 57 58 50 77 85 86 78) ($nYArmsOuter $nYArmsInner $nAux2) simpleGrading (1 1 1)
    hex (56 57 49 48 84 85 77 76) ($nYArmsInner $nYArmsOuter $nAux2) simpleGrading (1 1 1)
    hex (56 48 51 59 84 76 79 87) ($nYArmsOuter $nYArmsInner $nAux2) simpleGrading (1 1 1)
    
    hex (9 84 87 10 1 76 79 2) ($nAux1 $nYArmsInner $nYArmsOuter) simpleGrading (1 1 1)  //35
    hex (85 32 35 86 77 24 27 78) ($nAux1 $nYArmsInner $nYArmsOuter) simpleGrading (1 1 1)
    hex (2 79 87 10 6 75 83 14) ($nAux1 $nYArmsOuter $nYArmsInner) simpleGrading (1 1 1)
    hex (9 84 76 1 13 80 72 5) ($nAux1 $nYArmsOuter $nYArmsInner) simpleGrading (1 1 1)
    hex (78 27 35 86 74 31 39 82) ($nAux1 $nYArmsOuter $nYArmsInner) simpleGrading (1 1 1)
    hex (85 32 24 77 81 36 28 73) ($nAux1 $nYArmsOuter $nYArmsInner) simpleGrading (1 1 1) //40
    hex (5 72 75 6 13 80 83 14) ($nAux1 $nYArmsInner $nYArmsOuter) simpleGrading (1 1 1)
    
    hex (73 28 31 74 81 36 39 82) ($nAux1 $nYArmsInner $nYArmsOuter) simpleGrading (1 1 1)
    hex (79 78 86 87 75 74 82 83) ($nYArmsInner $nYArmsOuter $nYArmsInner) simpleGrading (1 1 1)
    hex (84 85 77 76 80 81 73 72) ($nYArmsInner $nYArmsOuter $nYArmsInner) simpleGrading (1 1 1)
    hex (72 73 74 75 80 81 82 83) ($nYArmsInner $nYArmsInner $nYArmsOuter) simpleGrading (1 1 1)  //35
    
    
    hex (10 87 95 18 14 83 91 22) ($nAux1 $nLayer $nYArmsInner) simpleGrading (1 1 1)
    hex (13 80 83 14 21 88 91 22) ($nAux1 $nYArmsInner $nLayer) simpleGrading (1 1 1)
    hex (17 92 84 9 21 88 80 13) ($nAux1 $nLayer $nYArmsInner) simpleGrading (1 1 1)
    hex (17 92 95 18 9 84 87 10) ($nAux1 $nYArmsInner $nLayer) simpleGrading (1 1 1)
    
    
    hex (86 35 43 94 82 39 47 90) ($nAux1 $nLayer $nYArmsInner) simpleGrading (1 1 1)
    hex (81 36 39 82 89 44 47 90) ($nAux1 $nYArmsInner $nLayer) simpleGrading (1 1 1)
    hex (93 40 32 85 89 44 36 81) ($nAux1 $nLayer $nYArmsInner) simpleGrading (1 1 1)
    hex (93 40 43 94 85 32 35 86) ($nAux1 $nYArmsInner $nLayer) simpleGrading (1 1 1)
    
    
    hex (59 58 66 67 87 86 94 95) ($nYArmsInner $nLayer $nAux2) simpleGrading (1 1 1)
    hex (87 86 94 95 83 82 90 91) ($nYArmsInner $nLayer $nYArmsInner) simpleGrading (1 1 1)
    hex (80 81 82 83 88 89 90 91) ($nYArmsInner $nYArmsInner $nLayer) simpleGrading (1 1 1)
    hex (92 93 85 84 88 89 81 80) ($nYArmsInner $nLayer $nYArmsInner) simpleGrading (1 1 1)


    hex (64 65 57 56 92 93 85 84) ($nYArmsInner $nLayer $nAux2) simpleGrading (1 1 1)
    hex (64 56 59 67 92 84 87 95) ($nLayer $nYArmsInner  $nAux2) simpleGrading (1 1 1)
    hex (57 65 66 58 85 93 94 86) ($nLayer $nYArmsInner  $nAux2) simpleGrading (1 1 1)
);

edges
(
    //- arcs for the inner mesh (inletA)
    arc 3 7 ($minusL 0.0 #calc "$minusb1*$f1") 
    arc 4 7 ($minusL #calc "$b1*$f1" 0.0) 
    arc 0 4  ($minusL 0.0 #calc "$b1*$f1")
    arc 0 3  ($minusL #calc "$minusb1*$f1" 0.0)
    
    arc 2 6 ($minusL1 0.0 #calc "$minusb1*$f1") 
    arc 5 6 ($minusL1 #calc "$b1*$f1" 0.0) 
    arc 1 5  ($minusL1 0.0 #calc "$b1*$f1")
    arc 1 2  ($minusL1 #calc "$minusb1*$f1" 0.0)

    //- arcs for the buffer mesh (inletA)    
    arc 11 15 ($minusL 0.0 #calc "$minusR1*$f1") 
    arc 12 15 ($minusL #calc "$R1*$f1" 0.0) 
    arc 8 12  ($minusL 0.0 #calc "$R1*$f1")
    arc 8 11  ($minusL #calc "$minusR1*$f1" 0.0)
    
    arc 10 14 ($minusL1 0.0 #calc "$minusR1*$f1") 
    arc 13 14 ($minusL1 #calc "$R1*$f1" 0.0) 
    arc 9 13  ($minusL1 0.0 #calc "$R1*$f1")
    arc 9 10  ($minusL1 #calc "$minusR1*$f1" 0.0)
    
    //- arcs for the outer mesh (inletA)
    arc 19 23 ($minusL 0.0 #calc "$minusR2") 
    arc 20 23 ($minusL #calc "$R2" 0.0) 
    arc 16 20  ($minusL 0.0 #calc "$R2")
    arc 16 19  ($minusL #calc "$minusR2" 0.0)
    
    arc 18 22 ($minusL1 0.0 #calc "$minusR2") 
    arc 21 22 ($minusL1 #calc "$R2" 0.0) 
    arc 17 21  ($minusL1 0.0 #calc "$R2")
    arc 17 18  ($minusL1 #calc "$minusR2" 0.0)
    
    //- arcs for the inner mesh (inletB)
    arc 26 30 ($L 0.0 #calc "$minusb1*$f1") 
    arc 29 30 ($L #calc "$b1*$f1" 0.0) 
    arc 25 29  ($L 0.0 #calc "$b1*$f1")
    arc 25 26  ($L #calc "$minusb1*$f1" 0.0)    
       
    //- arcs for the buffer mesh (inletB)
    arc 35 39 ($L1 0.0 #calc "$minusR1*$f1") 
    arc 36 39 ($L1 #calc "$R1*$f1" 0.0) 
    arc 32 36  ($L1 0.0 #calc "$R1*$f1")
    arc 32 35  ($L1 #calc "$minusR1*$f1" 0.0)
    
    arc 34 38 ($L 0.0 #calc "$minusR1*$f1") 
    arc 37 38 ($L #calc "$R1*$f1" 0.0) 
    arc 33 37  ($L 0.0 #calc "$R1*$f1")
    arc 33 34  ($L #calc "$minusR1*$f1" 0.0)
    
    //- arcs for the outer mesh (inletB)
    arc 43 47 ($L1 0.0 #calc "$minusR2") 
    arc 44 47 ($L1 #calc "$R2" 0.0) 
    arc 40 44  ($L1 0.0 #calc "$R2")
    arc 40 43 ($L1 #calc "$minusR2" 0.0)
    
    arc 42 46 ($L 0.0 #calc "$minusR2") 
    arc 45 46 ($L #calc "$R2" 0.0) 
    arc 41 45  ($L 0.0 #calc "$R2")
    arc 41 42  ($L #calc "$minusR2" 0.0)
    
    //- arcs for the connection mesh (inner)
    arc 80 83 (#calc "$minusR1*sqrt(2.0)/2.0" $R1 0)
    arc 81 82 (#calc "$R1*sqrt(2.0)/2.0" $R1 0) 
    
    arc 83 87 (#calc "$minusR1*sqrt(2.0)/2.0" 0 $minusR1)
    arc 82 86 (#calc "$R1*sqrt(2.0)/2.0" 0 $minusR1)
    
    arc 80 84 (#calc "$minusR1*sqrt(2.0)/2.0" 0 $R1)
    arc 81 85 (#calc "$R1*sqrt(2.0)/2.0" 0 $R1)
    
    arc 84 87 ($minusR1 $minusR1 0)
    arc 85 86 ($R1 $minusR1 0) 
    arc 84 85 (0 #calc "$minusR1*sqrt(2.0)/2.0" $R1)
    arc 87 86 (0 #calc "$minusR1*sqrt(2.0)/2.0" $minusR1)
    
    //-outer
    arc 88 91 (#calc "$minusR2*sqrt(2.0)/2.0" $R2 0)
    arc 89 90 (#calc "$R2*sqrt(2.0)/2.0" $R2 0) 
    
    arc 91 95 (#calc "$minusR2*sqrt(2.0)/2.0" 0 $minusR2)
    arc 90 94 (#calc "$R2*sqrt(2.0)/2.0" 0 $minusR2) 
    
    arc 88 92 (#calc "$minusR2*sqrt(2.0)/2.0" 0 $R2)
    arc 89 93 (#calc "$R2*sqrt(2.0)/2.0" 0 $R2)
    
    arc 92 95 ($minusR2 $minusR2 0)
    arc 93 94 ($R2 $minusR2 0)
    arc 92 93 (0 #calc "$minusR2*sqrt(2.0)/2.0" $R2)
    arc 94 95 (0 #calc "$minusR2*sqrt(2.0)/2.0" $minusR2)
    
    
    //- arcs for the outlet mesh (inner)
    arc 58 59 (0 $minusH $minusR1)
    arc 57 58 ($R1 $minusH 0)
    arc 56 57 (0 $minusH $R1)
    arc 56 59 ($minusR1 $minusH 0)
    
    //- arcs for the outlet mesh (outer)
    arc 66 67 (0 $minusH $minusR2)
    arc 65 66 ($R2 $minusH 0)
    arc 64 65 (0 $minusH $R2)
    arc 64 67 ($minusR2 $minusH 0)
    
    //- arcs for the outlet mesh (inner)
    arc 52 53 (0 $minusH1 $b1)
    arc 53 54 ($b1 $minusH1 0)
    arc 54 55 (0 $minusH1 $minusb1)
    arc 52 55 ($minusb1 $minusH1 0)
    
    //- arcs for the outlet mesh (buffer)
    arc 60 61 (0 $minusH1 $R1)
    arc 61 62 ($R1 $minusH1 0)
    arc 62 63 (0 $minusH1 $minusR1)
    arc 60 63 ($minusR1 $minusH1 0)
    
    //- arcs for the outlet mesh (outer)
    arc 68 69 (0 $minusH1 $R2)
    arc 69 70 ($R2 $minusH1 0)
    arc 70 71 (0 $minusH1 $minusR2)
    arc 68 71 ($minusR2 $minusH1 0)
    
    //- arcs for connection mesh
    arc 72 75 (#calc "$minusb1*sqrt(2.0)/2.0" $b1 0)
    arc 76 79 ($minusb1 $minusb1 0)
    arc 77 78 ($b1 $minusb1 0) 
    arc 48 51 ($minusb1 $minusH 0)
    
    arc 24 27 ($L1 #calc "$minusb1*$f1" 0.0)
    arc 73 74 (#calc "$b1*sqrt(2.0)/2.0" $b1 0) 
    arc 28 31 ($L1 #calc "$b1*$f1" 0.0) 
    arc 49 50 ($b1 $minusH 0)
    
);

boundary
(
    /*inletA
    {
        type patch;
        faces
        (
            (7 4 0 3)
        );
    }
    inletB
    {
        type patch;
        faces
        (
            (15 13 12 14)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (19 18 17 16)
        );
    }*/
    /*walls
    {
        type wall;
        faces
        (
            (7 6 2 3)
            (3 2 1 0)
            (6 5 4 7)
        );
    }*/
);

// ************************************************************************* //
