testCase/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  8
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    system;
    object      decomposeParDict;
}

/*---------------------------------------------------------------------------*/
numberOfSubdomains 16;


method          scotch; // simple;

simpleCoeffs
{
    n               (2 2 1);
    delta           0.001;
}
#include "nProc"

hierarchicalCoeffs
{
    n               (2 1 1);

    delta           0.001;
    order           xyz;
}

metisCoeffs
{
    processorWeights ( 1 1 1 1 );
}

manualCoeffs
{
    dataFile        ;
}

distributed     no;

// ************************************************************************* //
