testCase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    div(rhoPhi,U)         			Gauss linear;
    div(phi,alpha)        			Gauss vanLeer;
    div(phi,alpha.A)        			Gauss vanLeer;
    div(phi,k)            			bounded Gauss upwind;
    div(phi,epsilon)      			bounded Gauss upwind;
    div(phi,omega)        			bounded Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) 	Gauss linear;
    div(phi,var)          			bounded Gauss upwind;
    "div\(phi,Mg\)"                           bounded Gauss upwind; // changed
    "div\(phi,OH\)"                       	bounded Gauss upwind; // changed
    "div\(phi,Cl\)"                       	bounded Gauss upwind; // changed
    "div\(phi,Na\)"                       	bounded Gauss upwind; // changed

    div(phi,M)                  Gauss multivariateIndependent // multivariateSelection
    {
        M0    upwind; // changed
        M1    upwind; // changed
        M2    upwind; // changed
        M3    upwind; // changed
        M4    upwind; // changed
        M5    upwind; // changed

        // M0    vanLeer;
        // M1    vanLeer;
        // M2    vanLeer;
        // M3    vanLeer;
        // M4    vanLeer;
        // M5    vanLeer;
    };
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}
// ************************************************************************* //
